clc,clear,close all;
%程序改错，这是原始程序
% v=0:0.1:100;
% A=[v/30,(2.87-4*v/30),(5.95-8*v/30),(8.97-12*v/30)];
% B=[0,(2.87-5*v/30),(5.95-9*v/30),(8.97-13*v/30)];
% y=max(0,min(A)-max(B));
% plot(v,y,'r.')
% 很明显，这几个向量维度不同

% 改错

% 1.
% for v=0:0.1:100;
% A=[v/30,(2.87-4*v/30),(5.95-8*v/30),(8.97-12*v/30)];
% B=[0,(2.87-5*v/30),(5.95-9*v/30),(8.97-13*v/30)];
% y=max(0,min(A)-max(B));
% hold on
% plot(v,y,'r.')   
% end
%此办法基本解决，但是不推荐，能用矩阵就用矩阵

% 2.
v=0:0.1:100;
v=v';
f=size(v);
a=zeros(size(v));
A=[v/30,(2.87-4*v/30),(5.95-8*v/30),(8.97-12*v/30)];
g=min(A,[],2);
B=[a,(2.87-5*v/30),(5.95-9*v/30),(8.97-13*v/30)];
h=max(B,[],2)
i=g-h;
y=max(zeros(size(i)),i) %为了0和i向量作比较，要使0的维度和i相同；
hold on
plot(v,y,'r.')   %最终的目的使v,y的维度相同，才可以构图

% 矩阵最小值函数默认会将每列做比较，然后以行形式输出
% b=[1 2 8; 3 4 5; 5 6 4]
% c=min(b)
% 一般尽量写列向量进行构图
% % 怎么让最小值将每行做比较，然后以列的形式输出呢
% d=min([1 2 8; 3 4 5; 5 6 4],[],2)  %使用这种方法处理




